AccumulationRegisters/ТоварыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОрганизаций</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорВидЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннееПотреблениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремаркировкаТоваровГИСМ</v8:Type>
						<v8:Type>cfg:DocumentRef.МаркировкаТоваровГИСМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ДвижениеПродукцииИМатериалов</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаСырьяПереработчику</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаМатериаловВПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаАктивовПассивов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПартий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Первичное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПартияПроизводства</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроизводствоБезЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыОрганизаций/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка 
		ИЛИ УниверсальныеМеханизмыПартийИСебестоимости.ДвиженияЗаписываютсяРасчетомПартийИСебестоимости(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения") Тогда
		Возврат;
	КонецЕсли;
	
	БлокироватьДляИзменения = Истина;
	
	// Текущее состояние набора помещается во временную таблицу,
	// чтобы при записи получить изменение нового набора относительно текущего.
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Таблица.Период КАК Период,
	|	Таблица.АналитикаУчетаНоменклатуры,
	|	Таблица.Организация,
	|	Таблица.ВидЗапасов,
	|	Таблица.НомерГТД,
	|	(ВЫБОР Таблица.ВидДвижения КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА -Таблица.Количество
	|		ИНАЧЕ Таблица.Количество КОНЕЦ) КАК КоличествоПередЗаписью
	|ПОМЕСТИТЬ
	|	ДвиженияТоварыОрганизацийПередЗаписью
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций КАК Таблица
	|ГДЕ
	|	Таблица.Регистратор = &Регистратор
	|	И НЕ &ЭтоНовый
	|	И &РассчитыватьИзменения
	|	И &КонтролироватьОстатки
	|	И НЕ &ЭтоОбменДанными
		// Интересует только положительный приход или сторнирующий расход
	|	И (Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И Таблица.Количество > 0
	|		ИЛИ Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И Таблица.Количество < 0
	|		ИЛИ Таблица.Регистратор ССЫЛКА Документ.КорректировкаПоступления)
	|;
	|///////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Период                        КАК Период,
	|	Товары.Регистратор                   КАК Регистратор,
	|	Товары.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
	|	Товары.Организация                   КАК Организация,
	|	Товары.ВидЗапасов                    КАК ВидЗапасов,
	|	Товары.НомерГТД                      КАК НомерГТД,
	|	Товары.Количество                    КАК Количество,
	|	Товары.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
	|	Товары.НалогообложениеНДС            КАК НалогообложениеНДС,
	|	Товары.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	Товары.КорВидЗапасов                 КАК КорВидЗапасов,
	|	Товары.ОрганизацияОтгрузки           КАК ОрганизацияОтгрузки,
	|	Товары.ДокументРеализации            КАК ДокументРеализации,
	|	Товары.СтатьяРасходов                КАК СтатьяРасходов,
	|	Товары.АналитикаРасходов             КАК АналитикаРасходов,
	|	Товары.Номенклатура                  КАК Номенклатура,
	|	Товары.Характеристика                КАК Характеристика,
	|	Товары.Первичное                     КАК Первичное
	|ПОМЕСТИТЬ ТоварыОрганизацийПередЗаписью
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций КАК Товары
	|ГДЕ
	|	Товары.Регистратор = &Регистратор
	|	И &ПартионныйУчетВключен
	|");
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("ЭтоНовый", ДополнительныеСвойства.ЭтоНовый);
	Запрос.УстановитьПараметр("РассчитыватьИзменения", ПроведениеСерверУТ.РассчитыватьИзменения(ДополнительныеСвойства));
	Запрос.УстановитьПараметр("КонтролироватьОстатки", Константы.КонтролироватьТоварыОрганизацийПриОтменеПриходов.Получить());
	Запрос.УстановитьПараметр("ЭтоОбменДанными", ОбменДанными.Загрузка);
	Запрос.УстановитьПараметр("ПартионныйУчетВключен", ДополнительныеСвойства.ДляПроведения.ПартионныйУчетВключен);
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Выполнить();
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ УниверсальныеМеханизмыПартийИСебестоимости.ДвиженияЗаписываютсяРасчетомПартийИСебестоимости(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу.
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	МИНИМУМ(ТаблицаИзменений.ПериодПередЗаписью) КАК ПериодПередЗаписью,
		|	ТаблицаИзменений.АналитикаУчетаНоменклатуры,
		|	ТаблицаИзменений.Организация,
		|	ТаблицаИзменений.ВидЗапасов,
		|	ТаблицаИзменений.НомерГТД,
		|	СУММА(ТаблицаИзменений.КоличествоИзменение) КАК КоличествоИзменение
		|ПОМЕСТИТЬ
		|	ДвиженияТоварыОрганизацийИзменение
		|ИЗ (
		|	ВЫБРАТЬ
		|		Таблица.Период КАК ПериодПередЗаписью,
		|		NULL КАК ПериодПриЗаписи,
		|		Таблица.АналитикаУчетаНоменклатуры,
		|		Таблица.Организация,
		|		Таблица.ВидЗапасов,
		|		Таблица.НомерГТД,
		|		Таблица.КоличествоПередЗаписью КАК КоличествоИзменение
		|	ИЗ
		|		ДвиженияТоварыОрганизацийПередЗаписью КАК Таблица
		|	ГДЕ
		|		Таблица.Период <> НЕОПРЕДЕЛЕНО
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ
		|		NULL КАК ПериодПередЗаписью,
		|		Таблица.Период КАК ПериодПриЗаписи,
		|		Таблица.АналитикаУчетаНоменклатуры,
		|		Таблица.Организация,
		|		Таблица.ВидЗапасов,
		|		Таблица.НомерГТД,
		|		(ВЫБОР Таблица.ВидДвижения КОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА Таблица.Количество
		|			ИНАЧЕ -Таблица.Количество КОНЕЦ) КАК КоличествоИзменение
		|	ИЗ
		|		РегистрНакопления.ТоварыОрганизаций КАК Таблица
		|	ГДЕ
		|		Таблица.Регистратор = &Регистратор
				// Интересует только положительный приход или сторнирующий расход
		|		И ((Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И Таблица.Количество > 0)
		|			ИЛИ (Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И Таблица.Количество < 0)
		|			ИЛИ Таблица.Регистратор ССЫЛКА Документ.КорректировкаПоступления)
		|		И &РассчитыватьИзменения
		|		И &КонтролироватьОстатки
		|		И НЕ &ЭтоОбменДанными
		|) КАК ТаблицаИзменений
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаИзменений.АналитикаУчетаНоменклатуры,
		|	ТаблицаИзменений.Организация,
		|	ТаблицаИзменений.ВидЗапасов,
		|	ТаблицаИзменений.НомерГТД
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТаблицаИзменений.КоличествоИзменение) > 0
		|	ИЛИ МИНИМУМ(ТаблицаИзменений.ПериодПередЗаписью) < МАКСИМУМ(ТаблицаИзменений.ПериодПриЗаписи)
		|;
		|///////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(Таблица.Период, МЕСЯЦ) КАК МЕСЯЦ,
		|	Таблица.Организация                  КАК Организация,
		|	Таблица.Регистратор                  КАК Документ,
		|	ИСТИНА                               КАК ИзмененыДанныеДляПартионногоУчетаВерсии21
		|ПОМЕСТИТЬ ТоварыОрганизацийЗаданияКРасчетуСебестоимости
		|ИЗ
		|	(ВЫБРАТЬ
		|		Товары.Период                        КАК Период,
		|		Товары.Регистратор                   КАК Регистратор,
		|		Товары.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|		Товары.Организация                   КАК Организация,
		|		Товары.ВидЗапасов                    КАК ВидЗапасов,
		|		Товары.НомерГТД                      КАК НомерГТД,
		|		Товары.Количество                    КАК Количество,
		|		Товары.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
		|		Товары.НалогообложениеНДС            КАК НалогообложениеНДС,
		|		Товары.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|		Товары.КорВидЗапасов                 КАК КорВидЗапасов,
		|		Товары.ОрганизацияОтгрузки           КАК ОрганизацияОтгрузки,
		|		Товары.ДокументРеализации            КАК ДокументРеализации,
		|		Товары.СтатьяРасходов                КАК СтатьяРасходов,
		|		Товары.АналитикаРасходов             КАК АналитикаРасходов,
		|		Товары.Номенклатура                  КАК Номенклатура,
		|		Товары.Характеристика                КАК Характеристика,
		|		Товары.Первичное                     КАК Первичное
		|	ИЗ
		|		ТоварыОрганизацийПередЗаписью КАК Товары
		|	ГДЕ
		|		&ПартионныйУчетВключен
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Товары.Период                        КАК Период,
		|		Товары.Регистратор                   КАК Регистратор,
		|		Товары.АналитикаУчетаНоменклатуры    КАК АналитикаУчетаНоменклатуры,
		|		Товары.Организация                   КАК Организация,
		|		Товары.ВидЗапасов                    КАК ВидЗапасов,
		|		Товары.НомерГТД                      КАК НомерГТД,
		|		-Товары.Количество                   КАК Количество,
		|		Товары.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
		|		Товары.НалогообложениеНДС            КАК НалогообложениеНДС,
		|		Товары.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
		|		Товары.КорВидЗапасов                 КАК КорВидЗапасов,
		|		Товары.ОрганизацияОтгрузки           КАК ОрганизацияОтгрузки,
		|		Товары.ДокументРеализации            КАК ДокументРеализации,
		|		Товары.СтатьяРасходов                КАК СтатьяРасходов,
		|		Товары.АналитикаРасходов             КАК АналитикаРасходов,
		|		Товары.Номенклатура                  КАК Номенклатура,
		|		Товары.Характеристика                КАК Характеристика,
		|		Товары.Первичное                     КАК Первичное
		|	ИЗ
		|		РегистрНакопления.ТоварыОрганизаций КАК Товары
		|	ГДЕ
		|		Товары.Регистратор = &Регистратор
		|		И &ПартионныйУчетВключен
		|	) КАК Таблица
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(Таблица.Период, МЕСЯЦ),
		|	Таблица.Период,
		|	Таблица.Регистратор,
		|	Таблица.АналитикаУчетаНоменклатуры,
		|	Таблица.Организация,
		|	Таблица.ВидЗапасов,
		|	Таблица.НомерГТД,
		|	Таблица.ХозяйственнаяОперация,
		|	Таблица.НалогообложениеНДС,
		|	Таблица.КорАналитикаУчетаНоменклатуры,
		|	Таблица.КорВидЗапасов,
		|	Таблица.ОрганизацияОтгрузки,
		|	Таблица.ДокументРеализации,
		|	Таблица.СтатьяРасходов,
		|	Таблица.АналитикаРасходов,
		|	Таблица.Номенклатура,
		|	Таблица.Характеристика,
		|	Таблица.Первичное
		|ИМЕЮЩИЕ
		|	СУММА(Таблица.Количество) <> 0
		|;
		|///////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДвиженияТоварыОрганизацийПередЗаписью
		|");

	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("РассчитыватьИзменения", ПроведениеСерверУТ.РассчитыватьИзменения(ДополнительныеСвойства));
	Запрос.УстановитьПараметр("КонтролироватьОстатки", Константы.КонтролироватьТоварыОрганизацийПриОтменеПриходов.Получить());
	Запрос.УстановитьПараметр("ЭтоОбменДанными", ОбменДанными.Загрузка);
	Запрос.УстановитьПараметр("ПартионныйУчетВключен", ДополнительныеСвойства.ДляПроведения.ПартионныйУчетВключен);
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[0].Выбрать();
	Выборка.Следующий();
	
	// Новые изменения были помещены во временную таблицу.
	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	СтруктураВременныеТаблицы.Вставить("ДвиженияТоварыОрганизацийИзменение", Выборка.Количество > 0);
	
	ДополнительныеСвойства.ДляПроведения.Вставить("ИзмененыДанныеДляПартионногоУчетаВерсии21", Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
